#pragma once
#include "dpcm.h"
#include "huffman.h"
//индексы для зигзаг-сканирования
const int zigzagtable[64] = {
    0, 1, 5, 6, 14, 15, 27, 28,  
    2, 4, 7, 13, 16, 26, 29, 42,  
    3, 8, 12, 17, 25, 30, 41, 43,  
    9, 11, 18, 24, 31, 40, 44, 53,  
    10, 19, 23, 32, 39, 45, 52, 54, 
    20, 22, 33, 38, 46, 51, 55, 60,  
    21, 34, 37, 47, 50, 56, 59, 61,  
    35, 36, 48, 49, 57, 58, 62, 63   
};
//После DCT и квантования важные низкочастотные коэффициенты (верхний левый угол) имеют большие значения,  
//высокочастотные (правый нижний угол) — близки к нулю (для группировки последовательности нулей для сжатия)
void zigzag(int block[8][8], int output[64]);
//RLE - кодирование серий одинаковых значений в формате:
void encode_ACblock(BitStream *bs, int block[8][8], int is_lum);
void encode_ACcomponents(JPEGImage *jpeg, BitStream *bs);